W7D2/major_tuneage/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
    def create
        #create attribute because we want to be able to manipulate in view
        @user = User.new(user_params)
        if @user.save