W6D5/cats99/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save!
---
INSERT INTO "cats" ("birth_date", "created_at", "updated_at", "color", "name", "sex", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "sex" = $2, "description" = $3, "birth_date" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["color", "tiger-striped"], ["sex", "F"], ["description", "cute again!"], ["birth_date", "2017-07-06"], ["updated_at", "2019-11-23 00:24:45.873104"], ["id", 1]]