W6D3/first_routes/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(artwork_share_params)
    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["artwork_id", 4], ["viewer_id", 6], ["created_at", "2019-11-21 19:10:18.823651"], ["updated_at", "2019-11-21 19:10:18.823651"]]

  def destroy
    share = ArtworkShare.find_by(id: params[:id])
    if share
      share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = ?  [["id", 7]]