W6D3/first_routes/app/controllers/artworks_controller.rb

  def index
    owned = Artwork.where(artist_id: params[:user_id])
    shared_with = Artwork.joins(:shared_viewers).where(artwork_shares: {viewer_id: params[:user_id]})
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."artist_id" = ?  [["artist_id", 3]]
SELECT "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "artwork_shares"."viewer_id" = ?  [["viewer_id", "5"]]

  def create
    artwork = Artwork.new(artwork_params)

    if artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Picasso Meditating"], ["image_url", "www.dankpaintings.com"], ["artist_id", 7], ["created_at", "2019-11-21 18:50:34.742219"], ["updated_at", "2019-11-21 18:50:34.742219"]]

  def update
    artwork = Artwork.find(params[:id])
    artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = ?, "updated_at" = ? WHERE "artworks"."id" = ?  [["title", "Small Red Dog"], ["updated_at", "2019-11-21 18:51:21.053694"], ["id", 5]]

  def destroy
    artwork = Artwork.find_by(id: params[:id])
    if artwork
      artwork.destroy
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = ?  [["id", 4]]