W6D3/first_routes/app/controllers/comments_controller.rb

  def index
    if params.has_key?(:author_id)
      render json: Comment.where(author_id: params[:user_id])
    elsif params.has_key?(:artwork_id)
      render json: Comment.where(artwork_id: params[:artwork_id])
    else
      render json: Comment.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = ?  [["artwork_id", 4]]
SELECT "comments".* FROM "comments"

  def destroy
    comment = Comment.find_by(id: params[:id])
    if comment
      comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]