W6D3/first_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Ronil"], ["email", "ronil@app.com"], ["created_at", "2019-11-20 23:22:49.536814"], ["updated_at", "2019-11-20 23:22:49.536814"]]
---
  def create
    user = User.new(user_params)

    if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "blaaaaah@gamil.com"], ["updated_at", "2019-11-21 00:04:39.911140"], ["id", 3]]
---
  def update
    user = User.find(params[:id])
    user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 6]]
---
  def destroy
    user = User.find_by(id: params[:id])
    if user
      user.destroy