W7D2/major_tuneage/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def self.find_by_credentials(email, password)
        #finds user by email, and checks validity of password
        #no access to params in model!
        #want to return the user
        user = User.find_by(email: email)

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "lmbraUAGheBYqHWUatJ9rw"], ["updated_at", "2019-11-27 00:15:08.037882"], ["id", 6]]
---
    def reset_session_token
        #sets new session token
        self.session_token = User.generate_session_token
        #save user's session token to DB
        self.save